



IPv6 Maintenance (6man) Working Group                            F. Gont
Internet-Draft                                              SI6 Networks
Updates: 4861, 4862 (if approved)                                J. Zorz
Intended status: Standards Track                                6connect
Expires: December 8, 2022                                   R. Patterson
                                                                  Sky UK
                                                            June 6, 2022


Improving the Robustness of Stateless Address Autoconfiguration (SLAAC)
                      to Flash Renumbering Events
                     draft-ietf-6man-slaac-renum-04

Abstract

   In renumbering scenarios where an IPv6 prefix suddenly becomes
   invalid, hosts on the local network will continue using stale
   prefixes for an unacceptably long period of time, thus resulting in
   connectivity problems.  This document improves the reaction of IPv6
   Stateless Address Autoconfiguration to such renumbering scenarios.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on December 8, 2022.

Copyright Notice

   Copyright (c) 2022 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect



Gont, et al.            Expires December 8, 2022                [Page 1]

Internet-Draft       Reaction to Renumbering Events            June 2022


   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  SLAAC reaction to Flash-renumbering Events  . . . . . . . . .   4
     3.1.  Renumbering without Explicit Signaling  . . . . . . . . .   4
     3.2.  Renumbering with Explicit Signaling . . . . . . . . . . .   5
   4.  Improvements to Stateless Address Autoconfiguration (SLAAC) .   6
     4.1.  More Appropriate Lifetime Values  . . . . . . . . . . . .   7
       4.1.1.  Router Configuration Variables  . . . . . . . . . . .   7
     4.2.  Honor Small PIO Valid Lifetimes . . . . . . . . . . . . .   8
     4.3.  Interface Initialization  . . . . . . . . . . . . . . . .   9
     4.4.  Conveying Information in Router Advertisement (RA)
           Messages  . . . . . . . . . . . . . . . . . . . . . . . .  10
     4.5.  Recovery from Stale Configuration Information without
           Explicit Signaling  . . . . . . . . . . . . . . . . . . .  11
       4.5.1.  Configuration variables and constants . . . . . . . .  12
       4.5.2.  Protocol specification  . . . . . . . . . . . . . . .  13
   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  15
   6.  Implementation Status . . . . . . . . . . . . . . . . . . . .  15
     6.1.  More Appropriate Lifetime Values  . . . . . . . . . . . .  15
       6.1.1.  Router Configuration Variables  . . . . . . . . . . .  15
     6.2.  Honor Small PIO Valid Lifetimes . . . . . . . . . . . . .  16
       6.2.1.  Linux Kernel  . . . . . . . . . . . . . . . . . . . .  16
       6.2.2.  NetworkManager  . . . . . . . . . . . . . . . . . . .  16
     6.3.  Conveying Information in Router Advertisement (RA)
           Messages  . . . . . . . . . . . . . . . . . . . . . . . .  16
     6.4.  Recovery from Stale Configuration Information without
           Explicit Signaling  . . . . . . . . . . . . . . . . . . .  16
       6.4.1.  dhcpcd(8) . . . . . . . . . . . . . . . . . . . . . .  16
     6.5.  Other mitigations implemented in products . . . . . . . .  17
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .  17
   8.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  17
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  18
     9.1.  Normative References  . . . . . . . . . . . . . . . . . .  18
     9.2.  Informative References  . . . . . . . . . . . . . . . . .  19
   Appendix A.  Analysis of Some Suggested Workarounds . . . . . . .  21
     A.1.  On a Possible Reaction to ICMPv6 Error Messages . . . . .  21
     A.2.  On a Possible Improvement to Source Address Selection . .  22
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  23






Gont, et al.            Expires December 8, 2022                [Page 2]

Internet-Draft       Reaction to Renumbering Events            June 2022


1.  Introduction

   IPv6 network renumbering is usually assumed to take place in a
   planned manner, with old/stale prefixes being phased-out via reduced
   prefix lifetimes while new prefixes (with normal lifetimes) are
   introduced.  However, there are a number of scenarios that may lead
   to the so-called "flash-renumbering" events, where the prefix being
   employed on a network suddenly becomes invalid and replaced by a new
   prefix [RFC8978].  In such scenarios, hosts on the local network will
   continue using stale prefixes for an unacceptably long period of
   time, thus resulting in connectivity problems.  [RFC8978] discusses
   this problem in detail.

   In some scenarios, the local router triggering the network
   renumbering event may try to deprecate the currently-employed
   prefixes (by explicitly signaling the network about the renumbering
   event), whereas in other scenarios the renumbering event may happen
   inadvertently, without the router explicitly signaling the scenario
   to local hosts.

   From the perspective of a Stateless Address Autoconfiguration (SLAAC)
   host, there are two different (but related) problems to be solved:

   o  Avoiding the use of stale addresses for new communication
      instances

   o  Performing "garbage collection" for stale prefixes and related
      network configuration information

   Clearly, if a host has both working and stale addresses, it is
   paramount that it employs working addresses for new communication
   instances.  Additionally, a host should also perform garbage
   collection for the stale prefixes/addresses, since they not only
   unnecessarily tie system resources, but also prevent communication
   with the new "owners" of the stale prefixes.

2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.








Gont, et al.            Expires December 8, 2022                [Page 3]

Internet-Draft       Reaction to Renumbering Events            June 2022


3.  SLAAC reaction to Flash-renumbering Events

   As noted in Section 1, in some scenarios the router triggering the
   renumbering event may be able to explicitly signal this event, while
   in other scenarios the renumbered hosts may need to infer a
   renumbering event is taking place.  The following subsections analyze
   specific considerations for each of these scenarios.

3.1.  Renumbering without Explicit Signaling

   In the absence of explicit signalling from SLAAC routers (such as
   sending Prefix Information Options (PIOs) with small lifetimes to
   deprecate stale prefixes), stale prefixes will remain preferred and
   valid according to the Preferred Lifetime and Valid Lifetime
   parameters (respectively) of the last received PIO.  [RFC4861]
   specifies the following default values for PIOs:

   o  Preferred Lifetime (AdvPreferredLifetime): 604800 seconds (7 days)

   o  Valid Lifetime (AdvValidLifetime): 2592000 seconds (30 days)

   This means that, in the absence of explicit signaling by a SLAAC
   router to deprecate a prefix, it will take a host 7 days (one week)
   to deprecate the corresponding addresses, and 30 days (one month) to
   eventually remove any addresses configured for the stale prefix.
   Clearly, for any practical purposes, employing such long default
   values is generally unacceptable for most deployment scenarios that
   may experience flash-renumbering events.

   NOTE:
      [RFC8978] provides an operational recommendation for Customer Edge
      (CE) routers to override the standard default Preferred Lifetime
      (AdvPreferredLifetime) and Valid Lifetime (AdvValidLifetime) to
      2700 seconds (45 minutes) and 5400 seconds (90 minutes),
      respectively, thus improving the state of affairs for CE router
      scenarios.

   Use of more appropriate timers in Router Advertisement messages can
   help limit the amount of time that hosts will maintain stale
   configuration information.  Additionally, hosts may normally in a
   position to infer whether a prefix has become stale -- for example,
   if a router ceases to advertise an existing prefix while it continues
   to advertise other prefixes.

   Section 4.1.1 formally updates [RFC4861] to use of more appropriate
   (i.e., shorter) default lifetimes for PIOs, while Section 4.5
   specifies a local policy that SLAAC hosts may implement to infer that




Gont, et al.            Expires December 8, 2022                [Page 4]

Internet-Draft       Reaction to Renumbering Events            June 2022


   network configuration information has changed, such that stale
   configuration information can be phased out.

3.2.  Renumbering with Explicit Signaling

   In scenarios where a local router is aware about the renumbering
   event, it may try to phase out the stale network configuration
   information.  In these scenarios, there are two aspects to be
   considered:

   o  The amount of time during which the router should continue trying
      to deprecate the stale network configuration information

   o  The ability of SLAAC hosts to phase out stale configuration in a
      timelier manner.

   Since the network could be become partitioned at any arbitrary time
   and for an arbitrarily long period of time, routers need to
   contemplate the possible scenario where hosts receive an RA message,
   and the network subsequently becomes partitioned.  This means that in
   order to reliably deprecate stale information, a router would should
   try to deprecate a prefix for a period of time equal "Preferred
   Lifetime" used when advertising the prefix, and try to invalidate the
   prefix for a period of time equal to the "Valid Lifetime" (see
   Section 12 of [RFC4861]) used when advertising the prefix.

   NOTE:
      Once the number of seconds in the original "Preferred Lifetime"
      have elapsed, all hosts would have deprecated the corresponding
      addresses anyway, while once the number of seconds in the "Valid
      Lifetime" have elapsed, the corresponding addresses would be
      invalidated and removed.

   Thus, use of more appropriate default lifetimes for PIOs, as proposed
   in Section 4.1.1, would reduce the amount of time a stale prefix
   would need to be announced as such by a router in order to ensure
   that it is deprecated/invalidated.

   In scenarios where a router has positive knowledge that a prefix has
   become invalid and thus could signal this condition to local hosts,
   the current specifications will prevent SLAAC hosts from fully
   recovering from such stale information: Item "e)" of Section 5.5.3 of
   [RFC4862] specifies that an RA may never reduce the
   "RemainingLifetime" to less than two hours.  Additionally, if the
   RemainingLifetime of an address is smaller than 2 hours, then a Valid
   Lifetime smaller than 2 hours will be ignored.  The inability to
   invalidate a stale prefix may prevent communication with the new
   "owners" of a prefix, and thus is highly undesirable.  On the other



Gont, et al.            Expires December 8, 2022                [Page 5]

Internet-Draft       Reaction to Renumbering Events            June 2022


   hand, the Preferred Lifetime of an address *may* be reduced to any
   value to avoid the use of a stale prefix for new communications.

   Section 4.2 formally updates [RFC4862] to remove this restriction,
   such that hosts may react to the advertised "Valid Lifetime" even if
   it is smaller than 2 hours.

   Finally, Section 4.3 recommends that routers disseminate network
   configuration information when a network interface is initialized,
   such that new configuration information propagates in a timelier
   manner.

4.  Improvements to Stateless Address Autoconfiguration (SLAAC)

   The following subsections update [RFC4861] and [RFC4862], such that
   the problem discussed in this document is mitigated.  The updates in
   the following subsections are mostly orthogonal, and mitigate
   different aspects of SLAAC that prevent a timely reaction to flash
   renumbering events.

   o  Reduce the default Valid Lifetime and Preferred Lifetime of PIOs
      (Section 4.1.1):
      This helps limits the amount of time a host may employ stale
      information, and also limits the amount of time a router needs to
      try to deprecate stale information.

   o  Honor PIOs with small Valid Lifetimes (Section 4.2):
      This allows routers to invalidate stale prefixes, since otherwise
      [RFC4861] would prevent hosts from honoring PIOs with a Valid
      Lifetime smaller than two hours.

   o  Recommend routers to retransmit configuration information upon
      interface initialization/reinitialization (Section 4.3):
      This helps spread the new information in a timelier manner, and
      also deprecate stale information via host-side heuristics (see
      Section 4.5).

   o  Recommend routers to always send all options (i.e. the complete
      configuration information) in RA messages, and in the smallest
      possible number of packets (Section 4.4):
      This helps propagate the same information to all hosts, and also
      allows hosts to better infer that information missing in RA
      messages has become stale (see Section 4.5).

   o  Infer stale network configuration information from received RAs
      (Section 4.5):
      This allows hosts to deprecate stale network configuration
      information, even in the absence of explicit signaling.



Gont, et al.            Expires December 8, 2022                [Page 6]

Internet-Draft       Reaction to Renumbering Events            June 2022


4.1.  More Appropriate Lifetime Values

4.1.1.  Router Configuration Variables

   The standard default values of the Preferred Lifetime and the Valid
   Lifetime of PIOs are updated as follows:

      AdvPreferredLifetime: max(AdvDefaultLifetime, 3 *
      MaxRtrAdvInterval)

      AdvValidLifetime: 2 * AdvPreferredLifetime

   where:

   AdvPreferredLifetime:
      Value to be placed in the "Preferred Lifetime" field of the PIO.

   AdvValidLifetime:
      Value to be placed in the "Valid Lifetime" field of the PIO.

   AdvDefaultLifetime:
      Value to be placed in the "Router Lifetime" field of the Router
      Advertisement message that will carry the PIO.

   max():
      A function that computes the maximum of its arguments.

   NOTE:
      [RFC4861] specifies the default value of MaxRtrAdvInterval as 600
      seconds, and the default value of AdvDefaultLifetime as 3 *
      MaxRtrAdvInterval.  Therefore, when employing default values for
      MaxRtrAdvInterval and AdvDefaultLifetime, the default values of
      AdvPreferredLifetime and AdvValidLifetime become 1800 seconds (30
      minutes) and 3600 seconds (1 one hour), respectively.  We note
      that when implementing BCP202 [RFC7772], AdvDefaultLifetime will
      typically be in the range of 45-90 minutes, and therefore the
      default value of AdvPreferredLifetime will be in the range 45-90
      minutes, while the default value of AdvValidLifetime will be in
      the range of 90-180 minutes.

   RATIONALE:

      *  The default values of the PIO lifetimes should be such that,
         under normal circumstances (including some packet loss), the
         associated timers are refreshed/reset, but in the presence of
         network failures (such as network configuration information
         becoming stale), some fault recovering action (such as




Gont, et al.            Expires December 8, 2022                [Page 7]

Internet-Draft       Reaction to Renumbering Events            June 2022


         deprecating the corresponding addresses and subsequently
         removing them) is triggered.

      *  In the context of [RFC8028], where it is clear that the use of
         addresses configured for a given prefix is tied to the next-hop
         router that advertised the prefix, the "Preferred Lifetime" of
         a PIO should not be larger than the "Router Lifetime" of Router
         Advertisement messages.  Some leeway should be provided for the
         "Valid Lifetime" of PIOs, to cope with transient network
         problems.  As a result, this document updates [RFC4861] such
         that the default Valid Lifetime (AdvValidLifetime) and the
         default Preferred Lifetime (AdvPreferredLifetime) of PIOs are
         specified as a function of the "Router Lifetime"
         (AdvDefaultLifetime) of Router Advertisement messages.  In the
         absence of RAs that refresh information, addresses configured
         for previously-advertised prefixes become deprecated in a
         timelier manner, and thus Rule 3 of [RFC6724] will cause other
         configured addresses (if available) to be preferred.

      *  The expression above computes of maximum between
         AdvDefaultLifetime and "3 * MaxRtrAdvInterval" (the default
         value of AdvDefaultLifetime, as per [RFC4861]) to cope with the
         case where an operator might simply want to disable one local
         router for maintenance, without disabling the use of the
         corresponding prefixes on the local network (e.g., on a multi-
         router network).  Otherwise, [RFC4862] implementations would
         deprecate the corresponding prefixes.  Similarly, [RFC8028]
         implementations would likely behave in the same way.

4.2.  Honor Small PIO Valid Lifetimes

   The entire item "e)" (pp. 19-20) from Section 5.5.3 of [RFC4862] is
   replaced with the following text:

      e) If the advertised prefix is equal to the prefix of an address
      configured by stateless autoconfiguration in the list, the valid
      lifetime and the preferred lifetime of the address should be
      updated by processing the Valid Lifetime and the Preferred
      Lifetime (respectively) in the received advertisement.

   RATIONALE:

      *  This change allows hosts to react to the signal provided by a
         router that has positive knowledge that a prefix has become
         invalid.

      *  The behavior described in [RFC4862] had been incorporated
         during the revision of the original IPv6 Stateless Address



Gont, et al.            Expires December 8, 2022                [Page 8]

Internet-Draft       Reaction to Renumbering Events            June 2022


         Autoconfiguration specification ([RFC1971]).  At the time, the
         IPNG working group decided to mitigate the attack vector
         represented by Prefix Information Options with very short
         lifetimes, on the premise that these packets represented a
         bigger risk than other ND-based attack vectors [IPNG-minutes].

         While reconsidering the trade-offs represented by such
         decision, we conclude that the drawbacks of the aforementioned
         mitigation outweigh the possible benefits.

         In scenarios where RA-based attacks are of concern, proper
         mitigations such as RA-Guard [RFC6105] [RFC7113] or SEND
         [RFC3971] should be implemented.

4.3.  Interface Initialization

   When an interface is initialized, it is paramount that network
   configuration information is spread on the corresponding network
   (particularly in scenarios where an interface has been re-
   initialized, and the conveyed information has changed).  Thus, this
   document replaces the following text from Section 6.2.4 of [RFC4861]:

      In such cases, the router MAY transmit up to
      MAX_INITIAL_RTR_ADVERTISEMENTS unsolicited advertisements, using
      the same rules as when an interface becomes an advertising
      interface.

   with:

      In such cases, the router SHOULD transmit
      MAX_INITIAL_RTR_ADVERTISEMENTS unsolicited advertisements, using
      the same rules as when an interface becomes an advertising
      interface.

   RATIONALE:

      *  Use of stale information can lead to interoperability problems.
         Therefore, it is important that new configuration information
         propagates in a timelier manner to all hosts.

   NOTE:
      [RFC9096] specifies recommendations for CPE routers to signal any
      stale network configuration information.








Gont, et al.            Expires December 8, 2022                [Page 9]

Internet-Draft       Reaction to Renumbering Events            June 2022


4.4.  Conveying Information in Router Advertisement (RA) Messages

   Intentionally omitting information in Router Advertisements may
   prevent the propagation of such information, and may represent a
   challenge for hosts that need to infer whether they have received a
   complete set of SLAAC configuration information.  As a result, this
   section aims that, to the extent that is possible, RA messages
   contain a complete set of SLAAC information.

   This document replaces the following text from Section 6.2.3 of
   [RFC4861]:

      A router MAY choose not to include some or all options when
      sending unsolicited Router Advertisements.  For example, if prefix
      lifetimes are much longer than AdvDefaultLifetime, including them
      every few advertisements may be sufficient.  However, when
      responding to a Router Solicitation or while sending the first few
      initial unsolicited advertisements, a router SHOULD include all
      options so that all information (e.g., prefixes) is propagated
      quickly during system initialization.

      If including all options causes the size of an advertisement to
      exceed the link MTU, multiple advertisements can be sent, each
      containing a subset of the options.

   with:

      When sending Router Advertisements, a router SHOULD include all
      options.

      If including all options would cause the size of an advertisement
      to exceed the link MTU, multiple advertisements can be sent, each
      containing a subset of the options.  In all cases, routers SHOULD
      convey all information using the smallest possible number of
      packets. and try to convey options of the same type in the same
      packet.

   RATIONALE:

      *  Sending information in the smallest possible number of packets
         was somewhat already implied by the original text in [RFC4861].
         Including all options when sending RAs leads to simpler code
         (as opposed to dealing with special cases where specific
         information is intentionally omitted), and also helps hosts
         infer when they have received a complete set of SLAAC
         configuration information.  Note that while [RFC4861] allowed
         some RAs to omit some options, to the best of the authors'
         knowledge, all SLAAC router implementations always send all



Gont, et al.            Expires December 8, 2022               [Page 10]

Internet-Draft       Reaction to Renumbering Events            June 2022


         options in the smallest possible number of packets.  Therefore,
         this section simply aligns the protocol specifications with
         existing implementation practice.

4.5.  Recovery from Stale Configuration Information without Explicit
      Signaling

   This section specifies an algorithm that allows hosts to infer when a
   previously-advertised prefix has become stale, such that the stale
   configuration information can be "phased-out" in a timelier manner.
   Most of the value of this algorithm is in being able to mitigate the
   problem discussed in [RFC8978] at hosts themselves, without relying
   on updates of the behavior of local routers.

   The algorithm consists of two conceptual building-blocks:

   o  Detection of possible configuration change

   o  Validation/Refresh of configuration information

   Possible configuration changes can be inferred when a SLAAC router
   (as identified by its link-local address) ceases to advertise a
   previously-advertised prefix via PIOs, while while advertising other
   (possibly new) prefixes via PIOs.  In the light of possible
   configuration changes, configuration information can be validated/
   refreshed by polling the router in question with a unicast Router
   Solicitation message.  We note that in the context of multi-prefix/
   multi-router networks [RFC8028] [RFC8504], SLAAC prefixes are
   associated with each advertising SLAAC router.  Thus, when a router
   ceases to advertise a prefix:

   o  If this was the only router advertising the prefix, configured
      addresses for the stale prefixes should be deprecated (such that
      they are not employed for new communication instances), and they
      should eventually be invalidated (if this condition persists).

   o  If other routers were advertising the same prefix, the prefix
      should simply be dis-associated with the router that ceased to
      advertise it, and the fate of the corresponding addresses should
      depend on the routers that continue advertising the prefix.

   Implementation of this kind of heuristic allows a timelier reaction
   to network configuration changes even in scenarios where there is no
   explicit signaling from the network, thus improving robustness.

   As discussed in Section 4.4, [RFC4861] does not require routers to
   convey all RA options in the same message.  Therefore, the algorithm
   specified in this section is designed such that it can cope with such



Gont, et al.            Expires December 8, 2022               [Page 11]

Internet-Draft       Reaction to Renumbering Events            June 2022


   corner case that, while not found in the deployed Internet, could
   still theoretically take exist.

   Local information maintained for each prefix advertised by each
   router is augmented with one variable named "LTA_LA" (Lifetime
   Avoidance_Last Advertised), that records the last time a given prefix
   has been advertised by a given router.

   NOTE:
      While not strictly required, we note that existing implementations
      may already record the last time a prefix has been advertised by a
      given router as a possible implementation approach to be able to
      compute the remaining lifetime of an address.

      Hosts are already expected to keep track of which router has
      advertised which prefix in order to be able to properly select the
      first-hop router in multiple-prefix/multi-router networks
      [RFC8028] [RFC8504].  Throughout this specification, each router
      is identified by its link-local address.

4.5.1.  Configuration variables and constants

   Configuration variables:

   LTA_DEPRECATE:
      A time value (in seconds) that must elapse since the receipt of an
      RA message that triggers address/prefix deprecation, for the
      corresponding address/prefix to be deprecated (i.e., its
      "Preferred Lifetime" is set to 0).  It defaults to
      LTA_DEPRECATE_DEFAULT.  This value is a rough estimate of the
      maximum amount of time to send/receive a "batch" of RA messages
      that advertise the complete set of SLAAC information.

   LTA_INVALID:
      A time value (in seconds) that must elapse since the receipt of an
      RA message that triggers address/prefix deprecation, before
      addresses corresponding to a given prefix, and the "Valid
      Lifetime" of that prefix (for on-link determination), are be
      considered invalid.

   Default values (constants) for the previous configuration variables:

   LTA_DEPRECATE_DEFAULT:
      Default value for LTA_DEPRECATE.  Defined as 5 seconds.

   LTA_INVALID_DEFAULT:





Gont, et al.            Expires December 8, 2022               [Page 12]

Internet-Draft       Reaction to Renumbering Events            June 2022


      Default value for LTA_DEPRECATE.  Defined as 60 seconds.  This
      allows implementations to possibly send successive unicast RS
      messages, if needed, to elicit a response from the target router.

4.5.2.  Protocol specification

   After the normal processing of a received Router Advertisement
   message, a Router Advertisement that contains at least one PIO MUST
   be processed as follows:

   o  SEND_RS_FLAG = FALSE

   o  For each prefix prefix advertised by a PIO with the "A" flag set,
      proceed as follows:

      *  LTA_LA = current_time()

   o  IF the RA advertises at least one valid (Valid Lifetime >0) and
      preferred (Preferred Lifetime > 0) prefix for address
      autoconfiguration (PIO with A bit set to set), then for each
      prefix that had been previously advertised by this router but that
      is not advertised by a PIO (with the "A" flag set) in the received
      RA, proceed as follows:

      *  IF current_time() >= (LTA_LA + LTA_DEPRECATE) &&
         Preferred Lifetime > LTA_DEPRECATE && Valid Lifetime >
         LTA_INVALID, then:

         +  IF this is the only router advertising this prefix,

            -  Set the "Preferred Lifetime" and the "Valid Lifetime" of
               IPv6 addresses corresponding to this prefix to
               LTA_DEPRECATE and LTA_INVALID, respectively.

            -  Set the "Valid Lifetime" associated with this prefix (for
               on-link determination) to LTA_INVALID.

            -  SEND_RS_FLAG = TRUE

         +  ELSE IF this prefix has been advertised my multiple
            neighboring routers, simply disassociate this prefix with
            this particular router.  This will cause the fate of this
            prefix to depend on the other routers.

   o  IF SEND_RS_FLAG == TRUE

      *  ScheduleRS()




Gont, et al.            Expires December 8, 2022               [Page 13]

Internet-Draft       Reaction to Renumbering Events            June 2022


      *  SEND_RS_FLAG = FALSE

   NOTES:

   o  current_time() is a monotonically-increasing counter that is
      incremented once per second, and is employed to measure time.

   o  ScheduleRS() is a function that schedules an (asynchrononous)
      unicast RS/RA exchange with the target router (i.e., the function
      is non-blocking).  In a simple implementation, ScheduleRS() will
      simply cause a unicast RS message to be sent to the target router
      (subject to sending rules in [RFC4861]).  In a more elaborate
      implementation, the implementation may retransmit the RS message a
      number of times (subject to sending rules in [RFC4861]) until a
      response from the target router is received.

   o  SEND_RS_FLAG is a simple variable that is used to prevent a single
      received RA from scheduling the sending more than one unicast RS
      messages.

   o  The processing of RAs that do not contain any PIOs with the "A"
      bit set remains unaffected.

   o  Similarly, if the only prefix that has so been advertised on the
      local network is the prefix that has ceased to be advertised
      (i.e., there is no other prefix being advertised), the processing
      of the RA message remains unaffected -- the mechanism discussed in
      this document will *not* be triggered because received RAs will
      not contain other autoconfiguration prefixes (PIOs with the "A"
      bit set) that are both preferred and valid.  The rationale here is
      that it is better to have some address, than no address at all.

   o  The specified algorithm takes the conservative approach of setting
      the "Preferred Lifetime" to LTA_DEPRECATE to allow for SLAAC
      information to be conveyed in multiple RA messages (that can be
      sent during a window of LTA_DEPRECATE seconds), and setting "Valid
      Lifetime" to LTA_INVALID (to allow for validation of configuration
      information via unicast RS/RA exchanges).  Once the addresses for
      a prefix have been removed, associated routes incorporated by the
      original RA messages SHOULD also be removed.

   o  In cases where this scenario has been triggered by a CPE router
      crashing and rebooting (without keeping state of previous
      prefixes), it would take hosts LTA_DEPRECATE seconds to mark the
      corresponding addresses as "not preferred", and LTA_INVALID to
      completely remove such addresses from the system -- that is, 5
      seconds and 60 seconds, respectively.




Gont, et al.            Expires December 8, 2022               [Page 14]

Internet-Draft       Reaction to Renumbering Events            June 2022


   o  The pseudo-code above checks that "Preferred Lifetime >
      LTA_DEPRECATE && Valid Lifetime > LTA_INVALID" to prevent
      subsequent RA packets that do not contain a specific PIO from
      resetting the corresponding Preferred Lifetime and Valid Lifetime
      to LTA_DEPRECATE and LTA_INVALID (respectively) once they have
      already been reduced by this algorithm.  Otherwise, the Preferred
      Lifetime and Valid Lifetime might never get decremented to 0 as
      expected.

   o  If a prefix/address had been incorrectly inferred to be stale,
      subsequent solicited RAs (as a result of sending a unicast RS)
      and/or, any received unsolicited RAs would refresh the lifetime of
      the prefix, thus preventing the prefix and addresses from being
      phased out.

5.  IANA Considerations

   This document has no actions for IANA.

6.  Implementation Status

   [NOTE: This section is to be removed by the RFC-Editor before this
   document is published as an RFC.]

   This section summarizes the implementation status of the updates
   proposed in this document.  In some cases, they correspond to
   variants of the mitigations proposed in this document (e.g., use of
   reduced default lifetimes for PIOs, albeit using different values
   than those recommended in this document).  In such cases, we believe
   these implementations signal the intent to deal with the problems
   described in [RFC8978] while lacking any guidance on the best
   possible approach to do it.

6.1.  More Appropriate Lifetime Values

6.1.1.  Router Configuration Variables

6.1.1.1.  rad(8)

   We have produced a patch for OpenBSD's rad(8) [rad] that employs the
   default lifetimes recommended in this document, albeit it has not yet
   been committed to the tree.  The patch is available at:
   <https://www.gont.com.ar/code/fgont-patch-rad-pio-lifetimes.txt>.








Gont, et al.            Expires December 8, 2022               [Page 15]

Internet-Draft       Reaction to Renumbering Events            June 2022


6.1.1.2.  radvd(8)

   The radvd(8) daemon [radvd], normally employed by Linux-based router
   implementations, currently employs different default lifetimes than
   those recommended in [RFC4861]. radvd(8) employs the following
   default values [radvd.conf]:

   o  Preferred Lifetime: 14400 seconds (4 hours)

   o  Valid Lifetime: 86400 seconds (1 day)

   This is not following the specific recommendation in this document,
   bu is already a deviation from the current standards.

6.2.  Honor Small PIO Valid Lifetimes

6.2.1.  Linux Kernel

   A Linux kernel implementation of this document has been committed to
   the net-next tree.  The implementation was produced in April 2020 by
   Fernando Gont <fgont@si6networks.com>.  The corresponding patch can
   be found at: <https://patchwork.ozlabs.org/project/netdev/
   patch/20200419122457.GA971@archlinux-current.localdomain/>

6.2.2.  NetworkManager

   NetworkManager [NetworkManager] processes RA messages with a Valid
   Lifetime smaller than two hours as recommended in this document.

6.3.  Conveying Information in Router Advertisement (RA) Messages

   We know of no implementation that splits network configuration
   information into multiple RA messages.

6.4.  Recovery from Stale Configuration Information without Explicit
      Signaling

6.4.1.  dhcpcd(8)

   The dhcpcd(8) daemon [dhcpcd], a user-space SLAAC implementation
   employed by some Linux-based and BSD-derived operating systems, will
   set the Preferred Lifetime of addresses corresponding to a given
   prefix to 0 when a single RA from the router that previously
   advertised the prefix fails to advertise the corresponding prefix.
   However, it does not affect the corresponding Valid Lifetime.
   Therefore, it can be considered a partial implementation of this
   feature.




Gont, et al.            Expires December 8, 2022               [Page 16]

Internet-Draft       Reaction to Renumbering Events            June 2022


6.5.  Other mitigations implemented in products

   [FRITZ] is a Customer Edge Router that tries to deprecate stale
   prefixes by advertising stale prefixes with a Preferred Lifetime of
   0, and a Valid Lifetime of 2 hours (or less).  There are two things
   to note with respect to this implementation:

   o  Rather than recording prefixes on stable storage (as recommended
      in [RFC9096]), this implementation checks the source address of
      IPv6 packets, and assumes that usage of any address that does not
      correspond to a prefix currently-advertised by the Customer Edge
      Router is the result of stale network configuration information.
      Hence, upon receipt of a packet that employs a source address that
      does not correspond to a currently-advertised prefix, this
      implementation will start advertising the corresponding prefix
      with small lifetimes, with the intent of deprecating it.

   o  Possibly as a result of item "e)" (pp. 19-20) from Section 5.5.3
      of [RFC4862] (discussed in Section 4.2 of this document), upon
      first occurrence of a stale prefix, this implementation will
      employ a decreasing Valid Lifetime, starting from 2 hours (7200
      seconds), as opposed to a Valid Lifetime of 0.

7.  Security Considerations

   The protocol update in Section 4.2 could allow an on-link attacker to
   perform a Denial of Service attack against local hosts, by sending a
   forged RA with a PIO with a Valid Lifetime of 0.  Upon receipt of
   that packet, local hosts would invalidate the corresponding prefix,
   and therefore remove any addresses configured for that prefix,
   possibly terminating e.g. associated TCP connections.  However, an
   attacker may achieve similar effects via a number other Neighbor
   Discovery (ND) attack vectors, such as directing traffic to a non-
   existing node until ongoing TCP connections time out, or performing a
   ND-based man-in-the-middle (MITM) attack and subsequently forging TCP
   RST segments to cause on-going TCP connections to be reset.  Thus,
   for all practical purposes, this attack vector does not really
   represent any greater risk than other ND attack vectors.  As noted in
   Section 4.2 , in scenarios where RA-based attacks are of concern,
   proper mitigations such as RA-Guard [RFC6105] [RFC7113] or SEND
   [RFC3971] should be implemented.

8.  Acknowledgments

   The authors would like to thank (in alphabetical order) Mikael
   Abrahamsson, Tore Anderson, Luis Balbinot, Brian Carpenter, Lorenzo
   Colitti, Owen DeLong, Gert Doering, Thomas Haller, Nick Hilliard, Bob
   Hinden, Philip Homburg, Lee Howard, Christian Huitema, Tatuya Jinmei,



Gont, et al.            Expires December 8, 2022               [Page 17]

Internet-Draft       Reaction to Renumbering Events            June 2022


   Erik Kline, Ted Lemon, Jen Linkova, Albert Manfredi, Roy Marples,
   Florian Obser, Jordi Palet Martinez, Michael Richardson, Hiroki Sato,
   Mark Smith, Hannes Frederic Sowa, Dave Thaler, Tarko Tikan, Ole
   Troan, Eduard Vasilenko, and Loganaden Velvindron, for providing
   valuable comments on earlier versions of this document.

   The algorithm specified in Section 4.5 is the result of mailing-list
   discussions over previous versions of this document with Philip
   Homburg.

   Fernando would like to thank Alejandro D'Egidio and Sander Steffann
   for a discussion of these issues, which led to the publication of
   [RFC8978], and eventually to this document.

   Fernando would also like to thank Brian Carpenter who, over the
   years, has answered many questions and provided valuable comments
   that has benefited his protocol-related work.

9.  References

9.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              DOI 10.17487/RFC4861, September 2007,
              <https://www.rfc-editor.org/info/rfc4861>.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862,
              DOI 10.17487/RFC4862, September 2007,
              <https://www.rfc-editor.org/info/rfc4862>.

   [RFC7772]  Yourtchenko, A. and L. Colitti, "Reducing Energy
              Consumption of Router Advertisements", BCP 202, RFC 7772,
              DOI 10.17487/RFC7772, February 2016,
              <https://www.rfc-editor.org/info/rfc7772>.

   [RFC8028]  Baker, F. and B. Carpenter, "First-Hop Router Selection by
              Hosts in a Multi-Prefix Network", RFC 8028,
              DOI 10.17487/RFC8028, November 2016,
              <https://www.rfc-editor.org/info/rfc8028>.





Gont, et al.            Expires December 8, 2022               [Page 18]

Internet-Draft       Reaction to Renumbering Events            June 2022


   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8504]  Chown, T., Loughney, J., and T. Winters, "IPv6 Node
              Requirements", BCP 220, RFC 8504, DOI 10.17487/RFC8504,
              January 2019, <https://www.rfc-editor.org/info/rfc8504>.

9.2.  Informative References

   [dhcpcd]   Marples, R., "dhcpcd - a DHCP client",
              <https://roy.marples.name/projects/dhcpcd/>.

   [FRITZ]    Gont, F., "Quiz: Weird IPv6 Traffic on the Local Network
              (updated with solution)", SI6 Networks Blog, February
              2016, <https://www.si6networks.com/2016/02/16/quiz-weird-
              ipv6-traffic-on-the-local-network-updated-with-solution/>.

   [IPNG-minutes]
              IETF, "IPNG working group (ipngwg) Meeting Minutes",
              Proceedings of the thirty-eightt Internet Engineering Task
              Force , April 1997, <https://www.ietf.org/
              proceedings/38/97apr-final/xrtftr47.htm>.

   [NetworkManager]
              NetworkManager, "NetworkManager web site",
              <https://wiki.gnome.org/Projects/NetworkManager>.

   [rad]      Obser, F., "OpenBSD Router Advertisement Daemon - rad(8)",
              <https://cvsweb.openbsd.org/src/usr.sbin/rad/>.

   [radvd]    Hawkins, R. and R. Johnson, "Linux IPv6 Router
              Advertisement Daemon (radvd)",
              <http://www.litech.org/radvd/>.

   [radvd.conf]
              Hawkins, R. and R. Johnson, "radvd.conf - configuration
              file of the router advertisement daemon",
              <https://github.com/reubenhwk/radvd/blob/master/
              radvd.conf.5.man>.

   [RFC1971]  Thomson, S. and T. Narten, "IPv6 Stateless Address
              Autoconfiguration", RFC 1971, DOI 10.17487/RFC1971, August
              1996, <https://www.rfc-editor.org/info/rfc1971>.







Gont, et al.            Expires December 8, 2022               [Page 19]

Internet-Draft       Reaction to Renumbering Events            June 2022


   [RFC2827]  Ferguson, P. and D. Senie, "Network Ingress Filtering:
              Defeating Denial of Service Attacks which employ IP Source
              Address Spoofing", BCP 38, RFC 2827, DOI 10.17487/RFC2827,
              May 2000, <https://www.rfc-editor.org/info/rfc2827>.

   [RFC3971]  Arkko, J., Ed., Kempf, J., Zill, B., and P. Nikander,
              "SEcure Neighbor Discovery (SEND)", RFC 3971,
              DOI 10.17487/RFC3971, March 2005,
              <https://www.rfc-editor.org/info/rfc3971>.

   [RFC5927]  Gont, F., "ICMP Attacks against TCP", RFC 5927,
              DOI 10.17487/RFC5927, July 2010,
              <https://www.rfc-editor.org/info/rfc5927>.

   [RFC6105]  Levy-Abegnoli, E., Van de Velde, G., Popoviciu, C., and J.
              Mohacsi, "IPv6 Router Advertisement Guard", RFC 6105,
              DOI 10.17487/RFC6105, February 2011,
              <https://www.rfc-editor.org/info/rfc6105>.

   [RFC6724]  Thaler, D., Ed., Draves, R., Matsumoto, A., and T. Chown,
              "Default Address Selection for Internet Protocol Version 6
              (IPv6)", RFC 6724, DOI 10.17487/RFC6724, September 2012,
              <https://www.rfc-editor.org/info/rfc6724>.

   [RFC7113]  Gont, F., "Implementation Advice for IPv6 Router
              Advertisement Guard (RA-Guard)", RFC 7113,
              DOI 10.17487/RFC7113, February 2014,
              <https://www.rfc-editor.org/info/rfc7113>.

   [RFC8978]  Gont, F., Zorz, J., and R. Patterson, "Reaction of IPv6
              Stateless Address Autoconfiguration (SLAAC) to Flash-
              Renumbering Events", RFC 8978, DOI 10.17487/RFC8978, March
              2021, <https://www.rfc-editor.org/info/rfc8978>.

   [RFC9096]  Gont, F., Zorz, J., Patterson, R., and B. Volz, "Improving
              the Reaction of Customer Edge Routers to IPv6 Renumbering
              Events", BCP 234, RFC 9096, DOI 10.17487/RFC9096, August
              2021, <https://www.rfc-editor.org/info/rfc9096>.

   [slaacd]   Obser, F., "OpenBSD SLAAC Daemon - slaacd(8)",
              <https://cvsweb.openbsd.org/src/usr.sbin/slaacd/>.

   [systemd]  systemd, "systemd web site", <https://systemd.io/>.








Gont, et al.            Expires December 8, 2022               [Page 20]

Internet-Draft       Reaction to Renumbering Events            June 2022


Appendix A.  Analysis of Some Suggested Workarounds

   [This section is to be removed before publication of this document as
   an RFC].

   During the discussion of this document, some alternative workarounds
   were suggested on the 6man mailing-list.  The following subsections
   analyze these suggested workarounds, in the hopes of avoiding
   rehashing the same discussions.

A.1.  On a Possible Reaction to ICMPv6 Error Messages

   It has been suggested that if configured addresses become stale, a
   CPE enforcing ingress/egress filtering (BCP38) ([RFC2827]) could send
   ICMPv6 Type 1 (Destination Unreachable) Code 5 (Source address failed
   ingress/egress policy) error messages to the sending node, and that,
   upon receipt of such error messages, the sending node could perform
   heuristics that might help to mitigate the problem discussed in this
   document.

   The aforementioned proposal has a number of drawbacks and
   limitations:

   o  It assumes that the CPE routers enforce ingress/egress filtering
      [RFC2827].  While this is desirable behaviour, it cannot be relied
      upon.

   o  It assumes that if the CPE enforces ingress/egress filtering, the
      CPE will signal the packet drops to the sending node with ICMPv6
      Type 1 (Destination Unreachable) Code 5 (Source address failed
      ingress/egress policy) error messages.  While this may be
      desirable, [RFC2827] does not suggest signaling the packet drops
      with ICMPv6 error messages, let alone the use of specific error
      messages (such as Type 1 Code 5) as suggested.

   o  ICMPv6 Type 1 Code 5 could be interpreted as the employed address
      being stale, but also as a selected route being inappropriate/
      suboptimal.  If the later, deprecating addresses or invalidating
      addresses upon receipt of these error messages would be
      inappropriate.

   o  Reacting to these error messages would create a new attack vector
      that could be exploited from remote networks.  This is of
      particular concern since ICMP-based attacks do not even require
      that the Source Address of the attack packets be spoofed
      [RFC5927].





Gont, et al.            Expires December 8, 2022               [Page 21]

Internet-Draft       Reaction to Renumbering Events            June 2022


A.2.  On a Possible Improvement to Source Address Selection

   [RFC6724] specifies source address selection (SAS) for IPv6.
   Conceptually, it sorts the candidate set of source addresses for a
   given destination, based on a number of pair-wise comparison rules
   that must be successively applied until there is a "winning" address.

   An implementation might improve source address selection, and prefer
   the most-recently advertised information.  In order to incorporate
   the "freshness" of information in source address selection, an
   implementation would be updated as follows:

   o  The node is assumed to maintain a timer/counter that is updated at
      least once per second.  For example, the time(2) function from
      unix-like systems could be employed for this purpose.

   o  The local information associated with each prefix advertised via
      RAs on the local network is augmented with a "LastAdvertised"
      timestamp value.  Whenever an RA with a PIO with the "A" bit set
      for such prefix is received, the "LastAdvertised" timestamp is
      updated with the current value of the timer/counter.

   o  [RFC6724] is updated such that this rule is incorporated:

      Rule 7.5: Prefer fresh information  If one of the two source
         addresses corresponds to a prefix that has been more recently
         advertised, say LastAdvertised(SA) > LastAdvertised(SA), then
         prefer that address (SA in our case).

   A clear benefit of this approach is that a host will normally prefer
   "fresh" addresses over possibly stale addresses.

   However, there are a number of drawbacks associated with this
   approach:

   o  In scenarios where multiple prefixes are being advertised on the
      same LAN segment, the new SAS rule is *guaranteed* to result in
      non-deterministic behaviour, with hosts frequently changing the
      default source address.  This is certainly not desirable from a
      troubleshooting perspective.

   o  Since the rule must be incorporated before "Rule 8: Use longest
      matching prefix" from [RFC6724], it may lead to suboptimal paths.

   o  This new rule may help to improve the selection of a source
      address, but it does not help with the housekeeping (garbage
      collection) of configured information:




Gont, et al.            Expires December 8, 2022               [Page 22]

Internet-Draft       Reaction to Renumbering Events            June 2022


      *  If the stale prefix is re-used in another network, nodes
         employing stale addresses and routes for this prefix will be
         unable to communicate with the new "owner" of the prefix, since
         the stale prefix will most likely be considered "on-link".

      *  Given that the currently recommended default value for the
         "Valid Lifetime" of PIOs is 2592000 seconds (30 days), it would
         take too long for hosts to remove the configured addresses and
         routes for the stale prefix.  While the proposed update in
         Section 4.1 of this document would mitigate this problem, the
         lifetimes advertised by the local SLAAC router are not under
         the control of hosts.

   As a result, updating IPv6 source address selection does not relieve
   nodes from improving their SLAAC implementations as specified in
   Section 4, if at all desirable.  On the other hand, the algorithm
   specified in Section 4.5 would result in Rule 3 of [RFC6724]
   employing fresh addresses, without leading to non-deterministic
   behaviour.

Authors' Addresses

   Fernando Gont
   SI6 Networks
   Segurola y Habana 4310, 7mo Piso
   Villa Devoto, Ciudad Autonoma de Buenos Aires
   Argentina

   Email: fgont@si6networks.com
   URI:   https://www.si6networks.com


   Jan Zorz
   6connect

   Email: jan@connect.com


   Richard Patterson
   Sky UK

   Email: richard.patterson@sky.uk









Gont, et al.            Expires December 8, 2022               [Page 23]
